# Задание task_02_21.
#
# Выполнил: Малеванный И.Б.
# Группа: ЦИБ-241



n = int(input("n = "))

r_sr_m = 0.0
r_sr_d = 0.0
count = 0
r_sr_m_c = 0
r_sr_d_c = 0

for i in range(n):
    count+=1
    a = int(input("Рост {}-го ученика = ".format(count)))
    if a > 0:
      r_sr_d_c +=1
      r_sr_d += a
    if a < 0:
      r_sr_m_c += 1
      r_sr_m += a
r_sr_m = round(abs(r_sr_m/ r_sr_m_c),1)
r_sr_d = round((r_sr_d/r_sr_d_c),1)

print("Средний рост мальчиков: {:.1f}".format(r_sr_m))
print("Средний рост девочек: {:.1f}".format(r_sr_d))

# --------------
# Пример вывода:
#
# n = 5
# Рост 1-го ученика = 150
# Рост 2-го ученика = -150
# Рост 3-го ученика = 160
# Рост 4-го ученика = 170
# Рост 5-го ученика = 180
# Средний рост мальчиков: 150.0
# Средний рост девочек: 165.0